Revit 2024 API
SketchEditScope.IsSketchEditingSupported Method
 Checks whether sketch can be edited.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public bool IsSketchEditingSupported(
	ElementId sketchId
)
Visual Basic
Public Function IsSketchEditingSupported ( _
	sketchId As ElementId _
) As Boolean
Visual C++
public:
bool IsSketchEditingSupported(
	ElementId^ sketchId
)
Parameters
sketchId
Type: Autodesk.Revit.DB.ElementId
 The element id of sketch.
Return Value
 True if sketch can be edited, false otherwise.
Remarks
 This method checks if this particular sketch can be edited. If you want to check if all sketches of an element can be edited please use IsSketchEditingSupportedForSketchBasedElement(ElementId)
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
SketchEditScope Class
Autodesk.Revit.DB Namespace